<?php

use Coolcigarets\CliMaker\LeninSay;
use Coolcigarets\CliMaker\Say;


/**
 * You will see :
 * Выводит обычный текст
 */
$sayClass = new Say();
$sayClass->say('Выводит обычный текст');

/**
 * You will see:
 *                                                       ;▄▄████████████▄▄L
 *                                                   ▄▄██▀▀▀⌠`            "▀██▄
 *                                                  ╓█▀▀└                      ⌠▀██,
 *                                                  ╓█▀                             ▀██
 *                                                  ▄█                 ,▄▄ º▄          ▀█▄
 * Что такое Советская власть? В                    █                ╓ "▀█▄     ╦,       ██
 * чем заключается сущность этой                   █▀              ▄ ╙█Ç  ⌠▀     ⌠#'▀█▄ ╦,██
 * новой власти, которой не хотят                 ▄█                ║  ▀█▄   ▄▄       ▀▌   ╙█
 * или не могут понять еще в бол                 ▄█                  ╙        "▀W         , ▐█
 * ьшинстве стран? Сущность ее, п                █     ▄▄▄          ▀▄     ▀▀██▄▄▄,       ▐███W
 * ривлекающая к себе рабочих каж                ▀▌└███▀▀▀▀▀T       .'         ,           ▀██▌
 * дой страны все больше и больше               ▄▀   ▀██▀W▄-ⁿ"       ▀█▄▄▄█▀█▄, ▀█▄         ██▌
 * , состоит в том, что прежде го             ▄▀'     "▀'              '╙ ▄▄▄ █▌  ▀▌        ██▌
 * сударством управляли так или и           ▄█'                          ▐▀   ███           ██▌
 * наче богатые или капиталисты,            ▀█▄▄▄,▄▌                    ┌█,▄`▄███W         ▐██
 * а теперь в первый раз управляю           ▄█▀▀▀▀▀ ▐                    ╙╙ ╓██▌ `       ,███"
 * т государством, притом в массо           ▀█▄▄,    T                ,   ▄██▀▀▌      ██████
 * вом числе, как раз те классы,             ,█▀▀▀ª█▄                  ▀█▀⌠      ▐   ▐████▀
 * которых капитализм угнетал. Да            ▐█▀⌠   '▀▀                              ▄▄██▌
 * же в самой демократической, да          ,▄█╙▐█                                     ╓███
 * же в самой свободной республик         ▄█▀  `      ▄M                         ,▄&▀▀⌠╙██▌
 * е, пока остается господство ка        j█          '`           ▄▀         ,▄▀▀"      ███⌐
 * питала, пока земля остается в         ▐█   ▄▄▄▄█'         ,▄▄▄█▀       ▄█▀⌠          "███
 * частной собственности, государ        ▐███████████████▄ ▀█████┘    ▄▄█▀⌠             ╓▄██
 * ством всегда управляет небольш                       ╙▀█▄  ▀▀  ▄▄▀██▀             ╓▄██▀⌠
 * ое меньшинство, взятое на девя                          ▀█▄ ▄▄▀¡▄▀"             ▄███⌠
 * ть десятых из капиталистов или                          ,██▀└ ▄▀              ▄██▀
 * из богатых.                                           ▄█▀`  ▄▀              ▄██▀
 *                                                  ██   ▄▀              ╓██▀
 *                                                  █▌,▄▀               ▄██
 *                                                  j██▀                ██▀
 *                                                  ▄█▀          ,▄▄▄▄████▀
 *                                                  ▄█▀  ,▄▄▄▄██████▀▀▀▀'
 */
$leninSayClass = new LeninSay();
$leninSayClass->say('Что такое Советская власть? В чем заключается сущность этой новой власти, которой не хотят или не могут понять еще в большинстве стран? Сущность ее, привлекающая к себе рабочих каждой страны все больше и больше, состоит в том, что прежде государством управляли так или иначе богатые или капиталисты, а теперь в первый раз управляют государством, притом в массовом числе, как раз те классы, которых капитализм угнетал. Даже в самой демократической, даже в самой свободной республике, пока остается господство капитала, пока земля остается в частной собственности, государством всегда управляет небольшое меньшинство, взятое на девять десятых из капиталистов или из богатых. ');
